<?php


//########################
 echo "<br><br>課題1<br><br>";
//########################
$value1 = 20;
if($value1 >= 0){
	echo "0以上の数です";
}else{
	echo "負数です";
}



//########################
 echo "<br><br>課題2<br><br>";
//########################

$value2 = 9;
if(0 < $value2 && $value2 <= 100){
	echo $value2;
}else{
	echo "範囲外です";
}


//########################
 echo "<br><br>課題3<br><br>";
//########################
 $value3 = 9;
if($value3 % 2 == 0){
	echo "偶数です";
}else{
	echo "奇数です";
}


//########################
 echo "<br><br>課題4<br><br>";
//########################
$x = 3;
$y = 9;
if($x < $y){
	echo $y;
}elseif($y < $x){
	echo $x;
}elseif($y == $x){
	echo "同じです";
}

//########################
 echo "<br><br>課題5<br><br>";
//########################
$math = 60;
$english = 90;

if($math >= 60 && $english >= 60 && $math + $english >=140){
	echo "合格!";
}else{
	echo "残念!";
}

//########################
 echo "<br><br>課題6<br><br>";
//########################
$man = false;//女性
$age = 8;//8歳
if($man == false){
	echo "入れます";
}else{
	if($age < 10){
		echo "入れます";
	}else{
		echo "入れません";
	}
}


//########################
 echo "<br><br>課題7<br><br>";
//########################
for($i = 0;$i <=100;$i++){
	echo $i."<br>";
}

//########################
 echo "<br><br>課題8<br><br>";
//########################
for($i = 1;$i <= 9;$i++){
	echo "<br>";
	for($j = 1;$j <= 9;$j++){
		echo $i*$j." ";
	}
}

//########################
 echo "<br><br>課題9<br><br>";
//########################
for($i = 1;$i < 10;$i++){
	if($i < 3){
		echo $i."杯:余裕<br>";
	}elseif($i < 9){
		echo $i."杯:まだいける<br>";
	}else{
		echo $i."杯:寝る<br>";
	}
}



//########################
 echo "<br><br>課題10<br><br>";
//########################
for($i = 1;$i <= 100;$i++){
	if($i%3 == 0 && $i%5 == 0){
		echo "FizzBuzz"."<br>";
	}elseif($i%3 == 0){
		echo "Fizz"."<br>";
	}elseif($i%5 == 0){
		echo "Buzz"."<br>";
	}else{
		echo $i."<br>";
	}
}

//########################
 echo "<br><br>課題10<br><br>";
//########################
echo "素数：1とその数以外の数では割り切れない数字<br>";

//-------------------
//       解答1
//-------------------
$start = microtime(true);//処理時間計測用
echo "2<br>";
for($i = 2;$i <= 1000;$i++){//1は素数じゃないので2から始める
	for($j = 2;$j < $i;$j++){
		if($i%$j == 0){
			//echo $i."素数じゃない<br>";
			break;
		}elseif($j == $i - 1){
			echo $i."<br>";
		}
	}
}

$end = microtime(true);
echo "処理時間：" . ($end - $start) . "秒<br>";

//-------------------
//       解答2
//エラトステネスの篩:自然数nが√nを越えない最大の整数以下の全ての素数で割り切れなければ，nは素数である。
//ステップ 1:探索リストに2からxまでの整数を昇順で入れる。
//ステップ 2:探索リストの先頭の数を素数リストに移動し、その倍数を探索リストから篩い落とす。
//ステップ 3:上記の篩い落とし操作を探索リストの先頭値がxの平方根に達するまで行う。
//ステップ 4:探索リストに残った数を素数リストに移動して処理終了。
//-------------------
$start = microtime(true);
$max = 1000;
$sosuNum = [];
// maxの平方根の小数点切り捨て
$sqrt = floor(sqrt($max));
//素数かどうか判定する値を全て入れる
for ($i=2; $i<=$max; $i++) {
	$numArray[$i] = $i;
}
//全部の$numArrayの要素に対する処理.0番目には2が入っている。
for ($i=2; $i<=$sqrt; $i++) {
	if(isset($numArray[$i])){
		for ($j=$i*2; $j<=$max; $j+=$i) {
			unset($numArray[$j]);
		}
	}
}
foreach ($numArray as $num) {
	echo $num."<br>";
}

$end = microtime(true);
echo "処理時間：" . ($end - $start) . "秒<br>";


echo "複数やり方を思いついた時は、処理速度を比較してみる。";
/*
echo "<pre>";
var_dump($numarray);
echo "</pre>";
*/
?>







